--zad. da ne se dopuska promqna na MovieExec(insert, update, delete),
--ako srednata stoinost na Networht stawa pod 500 000
create trigger tr
on MovieExec
alter insert,update,delete
as
	if(select avg(networth) from MovieExec) < 500000
    begin 
		raiserror('...',16,1)
		rollback
	end;
--2.Напишете следните тригери за таблиците от базата от данни PC. Ако промените не удовлетворят условията ги отхвърляйте:
--А) При промяна на цената на някой компютър се уверете, че няма компютър с по-ниска цена и същата честота на процесора;
create trigger tr
on pc
alter update 
as
	if exists(select * from inserted i 
			  join  deleted s on i.code=d.code
			  join pc on i.speed=pc.speed
			  where d.price<>i.price and pc.price < i.price)
	begin 
		rollback....
--Б) Никой производител на компютри не може да произвежда и принтери;
--В) Всеки производител на компютър трябва да произвежда и лаптоп, който да има същата или по-висока честота на процесора;
--Г) При променяне на данните в таблицата Laptop се уверете, че средната цена на лаптопите за всеки производител е поне 2000;
--Д) При обновяване на RAM или HD полетата на даден компютър се уверете, че твърдия диск е поне 100 пъти по-голям от паметта;
--Е) Ако някой лаптоп има повече памет от някой компютър трябва да бъде и по-скъп от него;
--Ж) При добавянето на нов компютър, лаптоп или принтер се уверете, че модела не съществува в таблиците PC, Laptop и Printer;
--З) Ако в таблицата Products е спомената даден модел и неговия тип, то този модел трябва да се намира и в някоя от таблиците в зависимост от типа.
--при добавяне на кортежи в PC съответният кортеж трябва да бъде продукт с тип 'PC'; Да се вмъкнат само тези кортежи,
--които удовлетворяват условието.
create trigger tr
on PC
instead of insert
as
insert into pc
select i.*
from inserted i join product p on i.model=p.model
where p.type='PC';
--Задача 3
--Напишете следните тригери за таблиците от базата от данни Ships`. Ако промените не удовлетворят условията ги отхвърляйте:
--A) При добавянето на нов клас в таблицата Classes добавете и кораб със същото име в таблицата Ships, който да има дата на пускане NULL;
--Б) Ако бъде добавен нов клас с водоизместимост по-голяма от 35000, добавете класа в таблицата, но му задайте водоизместимост 35000;
--В) Никой клас не може да има повече от два кораба;
--Г) Кораб с повече от 9 оръдия не може да участва в битка с кораб, който е с по-малко от 9 оръдия;
--Д) (При тестване , не при create)При добавянето на нов запис в таблицата Outcomes се уверете, че корабът и битката съществуват в таблиците Ships и Battles. Ако не съществуват добавете информацията за тях в съответната таблицата като добавите NULL стойности, където е необходимо;
create trigger tr on outcomes
instead of insert 
as
	begin  insert into ships(name)
			select ship from inserted 
			where ship not in (select name from ships)
			insert into battles (name)
			select battle from inserted
			where battle not in (select name from battles)
			insert into outcomes 
			select * from inserted 
	end;
--Е) При добавянето на нов кораб или при промяна на класа на някой кораб се уверете, че никоя държава няма повече от 20 кораба;
--Ж) Кораб, който вече е потънал не може да участва в битка, чиято дата е след датата на потъването му;